app/controllers/projects_controller.rb

def create
  # render plain: params[:article].inspect
  #debugger # allows me to step though in server console
  @user = current_user
  @project = Project.new(project_params)
  @project.title_unique = "UN_" + @user.customer.id.to_s + "_" + @project.title
  @project.customer = @user.customer
#  @article.user = User.first
  if @project.save
---
INSERT INTO `projects` (`title`, `description`, `customer_id`, `created_at`, `updated_at`, `title_unique`) VALUES ('dddfff', 'sasdassss', '5', '2018-04-04 15:33:18', '2018-04-04 15:33:18', 'un_5_dddfff')