app/controllers/users_controller.rb

def set_user  #this is a method we created to remove having the same code in lots of functions
  @user = User.find(params[:id] )
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1

def create
  # render plain: params[:article].inspect
  #debugger # allows me to step though in server console
  @user = User.new(user_params)

  domain= @user.email.split("@").last
  if (@customer = Customer.where(domain: domain).present?)
      @customer = Customer.where(domain: domain).first
     else
      @customer = Customer.new
      @customer.name = domain
      @customer.domain = domain
      @customer.plan_id = 1
        if @customer.save
          flash[:notice] = 'New customer was created BOOM!' # we added an enrty in application GHTML wrapper to use this
         end
    end

  @user.customer = @customer
#  @article.user = User.first

puts("about to save , #{@user.firstname} , #{@user.customer.id}")

  if @user.save
---
SELECT  "customers".* FROM "customers" WHERE "customers"."domain" = $1 ORDER BY "customers"."id" ASC LIMIT $2  [["domain", "mailinator.com"], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."domain" = $1 LIMIT $2  [["domain", "mailinator.com"], ["LIMIT", 11]]
INSERT INTO "customers" ("name", "domain", "plan_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "mailinator.net"], ["domain", "mailinator.net"], ["plan_id", 1], ["created_at", "2018-04-02 16:01:30.767191"], ["updated_at", "2018-04-02 16:01:30.767191"]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
INSERT INTO `users` (`email`, `password_digest`, `firstname`, `lastname`, `customer_id`, `is_admin`, `is_owner`, `created_at`, `updated_at`) VALUES ('tom@there.com', '$2a$10$EvD9ybo8n.dRDvMcuxxOcOyW0FZIHp39QcLk4ovHgxAwCyOcQqZRC', 'test', 'name', 1, 1, 1, '2018-04-03 14:16:51', '2018-04-03 14:16:51')